young-nights/OTA-Upgrade-of-QI-Charger-Based-on-CAN/qi_wireless_code/libraries/drivers/src/at32f422_426_tmr.c
    case TMR_SELECT_CHANNEL_4:
      tmr_x->c4dt = tmr_channel_value;
      break;

    default:
      break;
  }
}

/**
  * @brief  get tmr channel value
  * @param  tmr_x: select the tmr peripheral.
  *         this parameter can be one of the following values:
  *         TMR1, TMR3, TMR4, TMR15, TMR16, TMR17
  * @param  tmr_channel
  *         this parameter can be one of the following values:
  *         - TMR_SELECT_CHANNEL_1   only available for TMR1, TMR3, TMR4, TMR15, TMR16, TMR17
  *         - TMR_SELECT_CHANNEL_2   only available for TMR1, TMR3, TMR4, TMR15
  *         - TMR_SELECT_CHANNEL_3   only available for TMR1, TMR3, TMR4
  *         - TMR_SELECT_CHANNEL_4   only available for TMR1, TMR3, TMR4
  * @retval tmr channel value
  */
uint32_t tmr_channel_value_get(tmr_type *tmr_x, tmr_channel_select_type tmr_channel)
{
  uint32_t cc_value_get = 0;
  uint16_t channel;

  channel = tmr_channel;

  /* get tmr channel value */
  switch(channel)
  {
    case TMR_SELECT_CHANNEL_1:
      cc_value_get = tmr_x->c1dt;
      break;

    case TMR_SELECT_CHANNEL_2:
      cc_value_get = tmr_x->c2dt;
      break;

    case TMR_SELECT_CHANNEL_3:
      cc_value_get = tmr_x->c3dt;
      break;

    case TMR_SELECT_CHANNEL_4:
      cc_value_get = tmr_x->c4dt;
      break;

    default:
      break;
  }

  return cc_value_get;
}
/**
  * @brief  enable tmr period buffer
  * @param  tmr_x: select the tmr peripheral.
  *         this parameter can be one of the following values:
  *         TMR1, TMR3, TMR4, TMR6, TMR15, TMR16, TMR17
  * @param  new_state (TRUE or FALSE)
  * @retval none
  */
void tmr_period_buffer_enable(tmr_type *tmr_x, confirm_state new_state)
{
  /* tmr period buffer set */
  tmr_x->ctrl1_bit.prben = new_state;
}

/**
  * @brief  enable tmr output channel buffer
  * @param  tmr_x: select the tmr peripheral.
  *         this parameter can be one of the following values:
  *         TMR1, TMR3, TMR4, TMR15, TMR16, TMR17
  * @param  tmr_channel
  *         this parameter can be one of the following values:
  *         - TMR_SELECT_CHANNEL_1   only available for TMR1, TMR3, TMR4, TMR15, TMR16, TMR17
  *         - TMR_SELECT_CHANNEL_2   only available for TMR1, TMR3, TMR4, TMR15
  *         - TMR_SELECT_CHANNEL_3   only available for TMR1, TMR3, TMR4
  *         - TMR_SELECT_CHANNEL_4   only available for TMR1, TMR3, TMR4
  * @param  new_state (TRUE or FALSE)
  * @retval none
  */
void tmr_output_channel_buffer_enable(tmr_type *tmr_x, tmr_channel_select_type tmr_channel, \
                                      confirm_state new_state)
{
  uint16_t channel;

  channel = tmr_channel;

  /* get tmr channel value */
  switch(channel)
  {
    case TMR_SELECT_CHANNEL_1:
      tmr_x->cm1_output_bit.c1oben = new_state;
      break;

    case TMR_SELECT_CHANNEL_2:
      tmr_x->cm1_output_bit.c2oben = new_state;
      break;

    case TMR_SELECT_CHANNEL_3:
      tmr_x->cm2_output_bit.c3oben = new_state;
      break;

    case TMR_SELECT_CHANNEL_4:
      tmr_x->cm2_output_bit.c4oben = new_state;
      break;

    default:
      break;
  }
}

/**
  * @brief  set tmr output channel immediately
  * @param  tmr_x: select the tmr peripheral.
  *         this parameter can be one of the following values:
  *         TMR1, TMR3, TMR4, TMR15, TMR16, TMR17
  * @param  tmr_channel
  *         this parameter can be one of the following values:
  *         - TMR_SELECT_CHANNEL_1   only available for TMR1, TMR3, TMR4, TMR15, TMR16, TMR17
  *         - TMR_SELECT_CHANNEL_2   only available for TMR1, TMR3, TMR4, TMR15
  *         - TMR_SELECT_CHANNEL_3   only available for TMR1, TMR3, TMR4
  *         - TMR_SELECT_CHANNEL_4   only available for TMR1, TMR3, TMR4
  * @param  new_state (TRUE or FALSE)
  * @retval none
  */
void tmr_output_channel_immediately_set(tmr_type *tmr_x, tmr_channel_select_type tmr_channel, \
                                        confirm_state new_state)
{
  uint16_t channel;

  channel = tmr_channel;

  /* get tmr channel value */
  switch(channel)
  {
    case TMR_SELECT_CHANNEL_1:
      tmr_x->cm1_output_bit.c1oien = new_state;
      break;

    case TMR_SELECT_CHANNEL_2:
      tmr_x->cm1_output_bit.c2oien = new_state;
      break;

    case TMR_SELECT_CHANNEL_3:
      tmr_x->cm2_output_bit.c3oien = new_state;
      break;

    case TMR_SELECT_CHANNEL_4:
      tmr_x->cm2_output_bit.c4oien = new_state;
      break;

    default:
      break;
  }
}

/**
  * @brief  select tmr output channel switch source
  * @param  tmr_x: select the tmr peripheral.
  *         this parameter can be one of the following values:
  *         TMR1, TMR3, TMR4
  * @param  switch_sel
  *         this parameter can be one of the following values:
  *         - TMR_CH_SWITCH_SELECT_EXT
  *         - TMR_CH_SWITCH_SELECT_CXORAW_OFF
  * @retval none
  */
void tmr_output_channel_switch_select(tmr_type *tmr_x, tmr_ch_switch_select_type switch_sel)
{
  /* select tmr output channel switch source */
  tmr_x->stctrl_bit.cossel = switch_sel;
}

/**
  * @brief  set tmr output channel switch
  * @param  tmr_x: select the tmr peripheral.
  *         this parameter can be one of the following values:
  *         TMR1, TMR3, TMR4, TMR15, TMR16, TMR17
  * @param  tmr_channel
  *         this parameter can be one of the following values:
  *         - TMR_SELECT_CHANNEL_1   only available for TMR1, TMR3, TMR4, TMR15, TMR16, TMR17
  *         - TMR_SELECT_CHANNEL_2   only available for TMR1, TMR3, TMR4, TMR15
  *         - TMR_SELECT_CHANNEL_3   only available for TMR1, TMR3, TMR4
  *         - TMR_SELECT_CHANNEL_4   only available for TMR1, TMR3, TMR4
  * @param  new_state (TRUE or FALSE)
  * @retval none
  */
void tmr_output_channel_switch_set(tmr_type *tmr_x, tmr_channel_select_type tmr_channel, \
                                   confirm_state new_state)
{
  uint16_t channel;

  channel = tmr_channel;

  /* get tmr channel value */
  switch(channel)
  {
    case TMR_SELECT_CHANNEL_1:
      tmr_x->cm1_output_bit.c1osen = new_state;
      break;

    case TMR_SELECT_CHANNEL_2:
      tmr_x->cm1_output_bit.c2osen = new_state;
      break;

    case TMR_SELECT_CHANNEL_3:
      tmr_x->cm2_output_bit.c3osen = new_state;
      break;

